<a href="https://colab.research.google.com/github/GayatriMunde/30DaysOfAI/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas


*   It helps to explore, clean and process tabular data

In [3]:
#Importing pandas
import pandas as pd

#### Reading tabular data file into pandas



*   Supported file formats are *(csv, excel, sql, json, parquet)
  *   To import data read_*
  *   To store data to_*

In [5]:
data = pd.read_table('http://bit.ly/chiporders')
data.head() #prints only first few rows

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [7]:
movie_data = pd.read_table('http://bit.ly/movieusers')
movie_data.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

But here the data is seprated by '|' also the first row is treated as header

In [9]:
movie_data = pd.read_table('http://bit.ly/movieusers', sep='|', header=None)
movie_data.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [10]:
#To define column names
user_cols = ['id', 'age', 'gender', 'occupation', 'zip_code']
movie_data = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)
movie_data.head()

   id  age gender  occupation zip_code
0   1   24      M  technician    85711
1   2   53      F       other    94043
2   3   23      M      writer    32067
3   4   24      M  technician    43537
4   5   33      F       other    15213

### Subset of a table
*   Selecting data
*   Indexing
*   Slicing

In [21]:
##Selecting data
ufo_data = pd.read_csv('http://bit.ly/uforeports')
ufo_data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [12]:
# Dot Notation
# Dot notation do not work if there is space in between
ufo_data.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [13]:
#Bracket Notation
ufo_data['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [14]:
ufo_data.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [15]:
#Rename the column name
ufo_data.rename(columns={'Colors Reported': 'Colors_Reported'}, inplace=True)

In [17]:
#Delete Single column
ufo_data.drop('Colors_Reported', axis =1, inplace=True)
ufo_data.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [22]:
#Delete multiple column
ufo_data.drop(['City', 'State'], axis=1, inplace=True)
ufo_data.head()

  Colors Reported Shape Reported             Time
0             NaN       TRIANGLE   6/1/1930 22:00
1             NaN          OTHER  6/30/1930 20:00
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00

In [23]:
#Delete rows
ufo_data.drop([0, 1], axis=0, inplace=True)
ufo_data.head()

  Colors Reported Shape Reported             Time
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00
5             NaN           DISK  9/15/1934 15:30
6             NaN         CIRCLE   6/15/1935 0:00